**Load sql and connect to the database**

In [6]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [15]:
%sql mysql://user:password@localhost/my_db

/anaconda3/lib/python3.5/site-packages/sqlalchemy/engine/default.py:508: Warning: (3719, "'utf8' is currently an alias for the character set UTF8MB3, but will be an alias for UTF8MB4 in a future release. Please consider using UTF8MB4 in order to be unambiguous.")
  cursor.execute(statement, parameters)

'Connected: root@my_db'

In [16]:
%sql USE my_db

 * mysql://root:***@localhost/my_db
0 rows affected.

[]

**Show tables and Describe columns of any table**

In [17]:
%sql SHOW TABLES

 * mysql://root:***@localhost/my_db
3 rows affected.

[('Bookings',), ('Facilities',), ('Members',)]

In [18]:
%sql DESCRIBE Facilities

 * mysql://root:***@localhost/my_db
6 rows affected.

[('facid', 'int(1)', 'NO', 'PRI', '0', ''),
 ('name', 'varchar(15)', 'YES', '', None, ''),
 ('membercost', 'decimal(2,1)', 'YES', '', None, ''),
 ('guestcost', 'decimal(3,1)', 'YES', '', None, ''),
 ('initialoutlay', 'int(5)', 'YES', '', None, ''),
 ('monthlymaintenance', 'int(4)', 'YES', '', None, '')]

schema-image

<img src='schema-horizontal.png'>

**Q1: Some of the facilities charge a fee to members, but some do not. Please list the names of the facilities that do**

In [19]:
%%sql 
SELECT * FROM facilities
LIMIT 50;

 * mysql://root:***@localhost/my_db
9 rows affected.

[(0, 'Tennis Court 1', Decimal('5.0'), Decimal('25.0'), 10000, 200),
 (1, 'Tennis Court 2', Decimal('5.0'), Decimal('25.0'), 8000, 200),
 (2, 'Badminton Court', Decimal('0.0'), Decimal('15.5'), 4000, 50),
 (3, 'Table Tennis', Decimal('0.0'), Decimal('5.0'), 320, 10),
 (4, 'Massage Room 1', Decimal('9.9'), Decimal('80.0'), 4000, 3000),
 (5, 'Massage Room 2', Decimal('9.9'), Decimal('80.0'), 4000, 3000),
 (6, 'Squash Court', Decimal('3.5'), Decimal('17.5'), 5000, 80),
 (7, 'Snooker Table', Decimal('0.0'), Decimal('5.0'), 450, 15),
 (8, 'Pool Table', Decimal('0.0'), Decimal('5.0'), 400, 15)]

In [20]:
%%sql
SELECT name
FROM facilities
WHERE membercost != 0

 * mysql://root:***@localhost/my_db
5 rows affected.

[('Tennis Court 1',),
 ('Tennis Court 2',),
 ('Massage Room 1',),
 ('Massage Room 2',),
 ('Squash Court',)]

**Q2: How many facilities do not charge a fee to members?**

In [21]:
%%sql
SELECT COUNT(name)
FROM facilities
WHERE membercost = 0

 * mysql://root:***@localhost/my_db
1 rows affected.

[(4,)]

**Q3: How can you produce a list of facilities that charge a fee to members,
where the fee is less than 20% of the facility's monthly maintenance cost?
Return the facid, facility name, member cost, and monthly maintenance of the
facilities in question.**

In [22]:
%%sql
SELECT facid, name, membercost, monthlymaintenance
FROM Facilities
WHERE membercost < .20*monthlymaintenance
AND membercost != 0

 * mysql://root:***@localhost/my_db
5 rows affected.

[(0, 'Tennis Court 1', Decimal('5.0'), 200),
 (1, 'Tennis Court 2', Decimal('5.0'), 200),
 (4, 'Massage Room 1', Decimal('9.9'), 3000),
 (5, 'Massage Room 2', Decimal('9.9'), 3000),
 (6, 'Squash Court', Decimal('3.5'), 80)]

**Q4: How can you retrieve the details of facilities with ID 1 and 5?
Write the query without using the OR operator.**

In [23]:
%%sql
SELECT *
FROM Facilities
WHERE facid IN (1,5)

 * mysql://root:***@localhost/my_db
2 rows affected.

[(1, 'Tennis Court 2', Decimal('5.0'), Decimal('25.0'), 8000, 200),
 (5, 'Massage Room 2', Decimal('9.9'), Decimal('80.0'), 4000, 3000)]

**Q5: How can you produce a list of facilities, with each labelled as
'cheap' or 'expensive', depending on if their monthly maintenance cost is more than \$100? Return the name and monthly maintenance of the facilities in question.**

In [24]:
%%sql
SELECT name,monthlymaintenance,
CASE WHEN monthlymaintenance > 100.0 THEN 'expensive'
     ELSE 'cheap' END AS category
FROM Facilities

 * mysql://root:***@localhost/my_db
9 rows affected.

[('Tennis Court 1', 200, 'expensive'),
 ('Tennis Court 2', 200, 'expensive'),
 ('Badminton Court', 50, 'cheap'),
 ('Table Tennis', 10, 'cheap'),
 ('Massage Room 1', 3000, 'expensive'),
 ('Massage Room 2', 3000, 'expensive'),
 ('Squash Court', 80, 'cheap'),
 ('Snooker Table', 15, 'cheap'),
 ('Pool Table', 15, 'cheap')]

**Q6: You'd like to get the first and last name of the last member(s)
who signed up. Do not use the LIMIT clause for your solution.**

In [47]:
%%sql
SELECT m.firstname, m.surname, joindate AS date_signed_up
FROM members AS m
WHERE joindate = (SELECT MAX(m.joindate) FROM members AS m)

 * mysql://root:***@localhost/my_db
1 rows affected.

[('Darren', 'Smith', '2012-09-26 18:08:45')]

**Q7: How can you produce a list of all members who have used a tennis court?
Include in your output the name of the court, and the name of the member formatted as a single column. Ensure no duplicate data, and order by the member name.**

In [30]:
%%sql
SELECT  sub.member, sub.name

FROM (SELECT DISTINCT(CONCAT(m.firstname, ' ' , m.surname)) AS member,
      f.name, b.facid, b.memid
    FROM Facilities AS f
    INNER JOIN Bookings AS b ON f.facid = b.facid
    INNER JOIN Members AS m ON m.memid = b.memid
    AND m.memid != 0) AS sub

WHERE sub.name LIKE 'Tennis%'
ORDER BY member

 * mysql://root:***@localhost/my_db
44 rows affected.

[('Anne Baker', 'Tennis Court 2'),
 ('Anne Baker', 'Tennis Court 1'),
 ('Burton Tracy', 'Tennis Court 1'),
 ('Burton Tracy', 'Tennis Court 2'),
 ('Charles Owen', 'Tennis Court 1'),
 ('Charles Owen', 'Tennis Court 2'),
 ('Darren Smith', 'Tennis Court 2'),
 ('David Farrell', 'Tennis Court 1'),
 ('David Farrell', 'Tennis Court 2'),
 ('David Jones', 'Tennis Court 2'),
 ('David Jones', 'Tennis Court 1'),
 ('David Pinker', 'Tennis Court 1'),
 ('Douglas Jones', 'Tennis Court 1'),
 ('Erica Crumpet', 'Tennis Court 1'),
 ('Florence Bader', 'Tennis Court 2'),
 ('Florence Bader', 'Tennis Court 1'),
 ('Gerald Butters', 'Tennis Court 1'),
 ('Gerald Butters', 'Tennis Court 2'),
 ('Henrietta Rumney', 'Tennis Court 2'),
 ('Jack Smith', 'Tennis Court 1'),
 ('Jack Smith', 'Tennis Court 2'),
 ('Janice Joplette', 'Tennis Court 1'),
 ('Janice Joplette', 'Tennis Court 2'),
 ('Jemima Farrell', 'Tennis Court 2'),
 ('Jemima Farrell', 'Tennis Court 1'),
 ('Joan Coplin', 'Tennis Court 1'),
 ('John Hunt', 'Tennis Court 1'),
 ('John Hunt', 'Tennis Court 2'),
 ('Matthew Genting', 'Tennis Court 1'),
 ('Millicent Purview', 'Tennis Court 2'),
 ('Nancy Dare', 'Tennis Court 2'),
 ('Nancy Dare', 'Tennis Court 1'),
 ('Ponder Stibbons', 'Tennis Court 2'),
 ('Ponder Stibbons', 'Tennis Court 1'),
 ('Ramnaresh Sarwin', 'Tennis Court 1'),
 ('Ramnaresh Sarwin', 'Tennis Court 2'),
 ('Tim Boothe', 'Tennis Court 2'),
 ('Tim Boothe', 'Tennis Court 1'),
 ('Tim Rownam', 'Tennis Court 2'),
 ('Tim Rownam', 'Tennis Court 1'),
 ('Timothy Baker', 'Tennis Court 2'),
 ('Timothy Baker', 'Tennis Court 1'),
 ('Tracy Smith', 'Tennis Court 1'),
 ('Tracy Smith', 'Tennis Court 2')]

**Q8: How can you produce a list of bookings on the day of 2012-09-14 which will cost the member (or guest) more than \$30? Remember that guests have different costs to members (the listed costs are per half-hour 'slot'), and the guest user's ID is always 0. Include in your output the name of the facility, the name of the member formatted as single column, and the cost.
Order by descending cost, and do not use any subqueries.**

In [26]:
%%sql
SELECT CONCAT(m.firstname, ' ' , m.surname) AS member, f.name,
    CASE WHEN m.memid != 0 THEN b.slots*f.membercost
         WHEN m.memid = 0 THEN  b.slots*f.guestcost END AS cost
FROM Members AS m
INNER JOIN Bookings AS b
ON m.memid = b.memid
INNER JOIN Facilities AS f
ON b.facid = f.facid
WHERE b.starttime >= '2012-09-14' AND b.starttime < '2012-09-15'
AND
(
( m.memid != 0 AND b.slots*f.membercost > 30)
OR
(m.memid = 0 AND b.slots*f.guestcost > 30)
)
ORDER BY cost DESC

 * mysql://root:***@localhost/my_db
12 rows affected.

[('GUEST GUEST', 'Massage Room 2', Decimal('320.0')),
 ('GUEST GUEST', 'Massage Room 1', Decimal('160.0')),
 ('GUEST GUEST', 'Massage Room 1', Decimal('160.0')),
 ('GUEST GUEST', 'Massage Room 1', Decimal('160.0')),
 ('GUEST GUEST', 'Tennis Court 2', Decimal('150.0')),
 ('GUEST GUEST', 'Tennis Court 1', Decimal('75.0')),
 ('GUEST GUEST', 'Tennis Court 1', Decimal('75.0')),
 ('GUEST GUEST', 'Tennis Court 2', Decimal('75.0')),
 ('GUEST GUEST', 'Squash Court', Decimal('70.0')),
 ('Jemima Farrell', 'Massage Room 1', Decimal('39.6')),
 ('GUEST GUEST', 'Squash Court', Decimal('35.0')),
 ('GUEST GUEST', 'Squash Court', Decimal('35.0'))]

** Q9: This time, produce the same result as in Q8, but using a subquery.**

In [50]:
%%sql
SELECT sub.member,  sub.name AS facility, sub.cost


FROM
    (SELECT CONCAT(m.firstname, ' ' , m.surname) AS member, f.name,
      CASE WHEN m.memid != 0 THEN b.slots*f.membercost
           WHEN m.memid = 0 THEN  b.slots*f.guestcost END AS cost 
      FROM Members AS m
      INNER JOIN Bookings AS b
      ON m.memid = b.memid
      INNER JOIN Facilities AS f
      ON b.facid = f.facid
      WHERE b.starttime >= '2012-09-14' AND 
      b.starttime < '2012-09-15'
      HAVING cost > 30) AS sub


ORDER BY cost DESC

 * mysql://root:***@localhost/my_db
12 rows affected.

[('GUEST GUEST', 'Massage Room 2', Decimal('320.0')),
 ('GUEST GUEST', 'Massage Room 1', Decimal('160.0')),
 ('GUEST GUEST', 'Massage Room 1', Decimal('160.0')),
 ('GUEST GUEST', 'Massage Room 1', Decimal('160.0')),
 ('GUEST GUEST', 'Tennis Court 2', Decimal('150.0')),
 ('GUEST GUEST', 'Tennis Court 1', Decimal('75.0')),
 ('GUEST GUEST', 'Tennis Court 1', Decimal('75.0')),
 ('GUEST GUEST', 'Tennis Court 2', Decimal('75.0')),
 ('GUEST GUEST', 'Squash Court', Decimal('70.0')),
 ('Jemima Farrell', 'Massage Room 1', Decimal('39.6')),
 ('GUEST GUEST', 'Squash Court', Decimal('35.0')),
 ('GUEST GUEST', 'Squash Court', Decimal('35.0'))]

**Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members! **

In [53]:
%%sql
SELECT revenue, facility
FROM
    (SELECT SUM(CASE WHEN b.memid != 0 THEN b.slots*f.membercost
                 WHEN b.memid = 0 THEN b.slots*f.guestcost END)  AS revenue,
        f.name AS facility
    FROM Bookings AS b
    INNER JOIN Facilities AS f
    ON b.facid = f.facid 
    GROUP BY f.name
    HAVING revenue < 1000
    ) AS sub

ORDER BY revenue

 * mysql://root:***@localhost/my_db
3 rows affected.

[(Decimal('180.0'), 'Table Tennis'),
 (Decimal('240.0'), 'Snooker Table'),
 (Decimal('270.0'), 'Pool Table')]

---